Revit 2027 API
BuiltInFailures.LinkFailures.CannotOpenLinkedFileServerFound Property
 Cannot open the linked model using Open and Unload because the plugin [name] provided by [vendor] experienced an error. For more information please contact [vendor].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotOpenLinkedFileServerFound { get; }
Public Shared ReadOnly Property CannotOpenLinkedFileServerFound As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotOpenLinkedFileServerFound {
	FailureDefinitionId^ get ();
}
static member CannotOpenLinkedFileServerFound : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace